package com.study.riotservice;

import com.fasterxml.jackson.databind.ObjectMapper;
import com.study.riotservice.dto.Champion;
import lombok.extern.slf4j.Slf4j;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Service;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by bluegony on 2018. 6. 15..
 */
@Slf4j
@Service
public class ChampUtil {

    @Autowired
    TempStatMapper tempStatMapper;

    static Map<Integer,String> champMap;


    /**
     * https://developer.riotgames.com/api-methods/#champion-v3/GET_getChampions
     */
    public static Map<Integer,String> championData() {

        if(champMap!=null) {
            return champMap;
        }
        champMap = new HashMap<>();


        String json = "{\n" +
                "       \"data\": [ {\n" +
                "            \"title\": \"원숭이 왕\",\n" +
                "            \"id\": 62,\n" +
                "            \"key\": \"MonkeyKing\",\n" +
                "            \"name\": \"오공\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"무기의 달인\",\n" +
                "            \"id\": 24,\n" +
                "            \"key\": \"Jax\",\n" +
                "            \"name\": \"잭스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"종말의 전조\",\n" +
                "            \"id\": 9,\n" +
                "            \"key\": \"Fiddlesticks\",\n" +
                "            \"name\": \"피들스틱\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"악마 어릿광대\",\n" +
                "            \"id\": 35,\n" +
                "            \"key\": \"Shaco\",\n" +
                "            \"name\": \"샤코\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"자운의 고삐 풀린 분노\",\n" +
                "            \"id\": 19,\n" +
                "            \"key\": \"Warwick\",\n" +
                "            \"name\": \"워윅\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"저항하는 자\",\n" +
                "            \"id\": 498,\n" +
                "            \"key\": \"Xayah\",\n" +
                "            \"name\": \"자야\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"야성의 사냥꾼\",\n" +
                "            \"id\": 76,\n" +
                "            \"key\": \"Nidalee\",\n" +
                "            \"name\": \"니달리\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"가시 덩굴의 복수\",\n" +
                "            \"id\": 143,\n" +
                "            \"key\": \"Zyra\",\n" +
                "            \"name\": \"자이라\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"망나니 기사\",\n" +
                "            \"id\": 240,\n" +
                "            \"key\": \"Kled\",\n" +
                "            \"name\": \"클레드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"타오르는 복수\",\n" +
                "            \"id\": 63,\n" +
                "            \"key\": \"Brand\",\n" +
                "            \"name\": \"브랜드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"중무장 아르마딜로\",\n" +
                "            \"id\": 33,\n" +
                "            \"key\": \"Rammus\",\n" +
                "            \"name\": \"람머스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"크라켄의 여사제\",\n" +
                "            \"id\": 420,\n" +
                "            \"key\": \"Illaoi\",\n" +
                "            \"name\": \"일라오이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"대담한 폭격수\",\n" +
                "            \"id\": 42,\n" +
                "            \"key\": \"Corki\",\n" +
                "            \"name\": \"코르키\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"프렐요드의 심장\",\n" +
                "            \"id\": 201,\n" +
                "            \"key\": \"Braum\",\n" +
                "            \"name\": \"브라움\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"녹서스의 실력자\",\n" +
                "            \"id\": 122,\n" +
                "            \"key\": \"Darius\",\n" +
                "            \"name\": \"다리우스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"야만전사 왕\",\n" +
                "            \"id\": 23,\n" +
                "            \"key\": \"Tryndamere\",\n" +
                "            \"name\": \"트린다미어\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"현상금 사냥꾼\",\n" +
                "            \"id\": 21,\n" +
                "            \"key\": \"MissFortune\",\n" +
                "            \"name\": \"미스 포츈\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"영혼의 길잡이\",\n" +
                "            \"id\": 83,\n" +
                "            \"key\": \"Yorick\",\n" +
                "            \"name\": \"요릭\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"초월한 마법사\",\n" +
                "            \"id\": 101,\n" +
                "            \"key\": \"Xerath\",\n" +
                "            \"name\": \"제라스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"전장의 여제\",\n" +
                "            \"id\": 15,\n" +
                "            \"key\": \"Sivir\",\n" +
                "            \"name\": \"시비르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"추방자\",\n" +
                "            \"id\": 92,\n" +
                "            \"key\": \"Riven\",\n" +
                "            \"name\": \"리븐\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"시계태엽 소녀\",\n" +
                "            \"id\": 61,\n" +
                "            \"key\": \"Orianna\",\n" +
                "            \"name\": \"오리아나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"바다의 무법자\",\n" +
                "            \"id\": 41,\n" +
                "            \"key\": \"Gangplank\",\n" +
                "            \"name\": \"갱플랭크\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"거석의 파편\",\n" +
                "            \"id\": 54,\n" +
                "            \"key\": \"Malphite\",\n" +
                "            \"name\": \"말파이트\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"망치의 수호자\",\n" +
                "            \"id\": 78,\n" +
                "            \"key\": \"Poppy\",\n" +
                "            \"name\": \"뽀삐\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"얼음 마녀\",\n" +
                "            \"id\": 127,\n" +
                "            \"key\": \"Lissandra\",\n" +
                "            \"name\": \"리산드라\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"미래의 수호자\",\n" +
                "            \"id\": 126,\n" +
                "            \"key\": \"Jayce\",\n" +
                "            \"name\": \"제이스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"설인 기수\",\n" +
                "            \"id\": 20,\n" +
                "            \"key\": \"Nunu\",\n" +
                "            \"name\": \"누누\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"트롤 왕\",\n" +
                "            \"id\": 48,\n" +
                "            \"key\": \"Trundle\",\n" +
                "            \"name\": \"트런들\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"죽음을 노래하는 자\",\n" +
                "            \"id\": 30,\n" +
                "            \"key\": \"Karthus\",\n" +
                "            \"name\": \"카서스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"무법자\",\n" +
                "            \"id\": 104,\n" +
                "            \"key\": \"Graves\",\n" +
                "            \"name\": \"그레이브즈\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"여명의 성위\",\n" +
                "            \"id\": 142,\n" +
                "            \"key\": \"Zoe\",\n" +
                "            \"name\": \"조이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"잃어버린 고리\",\n" +
                "            \"id\": 150,\n" +
                "            \"key\": \"Gnar\",\n" +
                "            \"name\": \"나르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"광명의 소녀\",\n" +
                "            \"id\": 99,\n" +
                "            \"key\": \"Lux\",\n" +
                "            \"name\": \"럭스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"하프 드래곤\",\n" +
                "            \"id\": 102,\n" +
                "            \"key\": \"Shyvana\",\n" +
                "            \"name\": \"쉬바나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"사막의 도살자\",\n" +
                "            \"id\": 58,\n" +
                "            \"key\": \"Renekton\",\n" +
                "            \"name\": \"레넥톤\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"결투의 대가\",\n" +
                "            \"id\": 114,\n" +
                "            \"key\": \"Fiora\",\n" +
                "            \"name\": \"피오라\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"난폭한 말괄량이\",\n" +
                "            \"id\": 222,\n" +
                "            \"key\": \"Jinx\",\n" +
                "            \"name\": \"징크스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"복수의 화신\",\n" +
                "            \"id\": 429,\n" +
                "            \"key\": \"Kalista\",\n" +
                "            \"name\": \"칼리스타\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"대양의 말썽꾸러기\",\n" +
                "            \"id\": 105,\n" +
                "            \"key\": \"Fizz\",\n" +
                "            \"name\": \"피즈\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 방랑자\",\n" +
                "            \"id\": 38,\n" +
                "            \"key\": \"Kassadin\",\n" +
                "            \"name\": \"카사딘\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"현의 명인\",\n" +
                "            \"id\": 37,\n" +
                "            \"key\": \"Sona\",\n" +
                "            \"name\": \"소나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"칼날 무희\",\n" +
                "            \"id\": 39,\n" +
                "            \"key\": \"Irelia\",\n" +
                "            \"name\": \"이렐리아\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"기계화의 전령관\",\n" +
                "            \"id\": 112,\n" +
                "            \"key\": \"Viktor\",\n" +
                "            \"name\": \"빅토르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"매혹하는 자\",\n" +
                "            \"id\": 497,\n" +
                "            \"key\": \"Rakan\",\n" +
                "            \"name\": \"라칸\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"영겁의 사냥꾼\",\n" +
                "            \"id\": 203,\n" +
                "            \"key\": \"Kindred\",\n" +
                "            \"name\": \"킨드레드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"독사의 포옹\",\n" +
                "            \"id\": 69,\n" +
                "            \"key\": \"Cassiopeia\",\n" +
                "            \"name\": \"카시오페아\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"뒤틀린 나무 정령\",\n" +
                "            \"id\": 57,\n" +
                "            \"key\": \"Maokai\",\n" +
                "            \"name\": \"마오카이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"거산의 화염\",\n" +
                "            \"id\": 516,\n" +
                "            \"key\": \"Ornn\",\n" +
                "            \"name\": \"오른\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"지옥의 간수\",\n" +
                "            \"id\": 412,\n" +
                "            \"key\": \"Thresh\",\n" +
                "            \"name\": \"쓰레쉬\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"심판자\",\n" +
                "            \"id\": 10,\n" +
                "            \"key\": \"Kayle\",\n" +
                "            \"name\": \"케일\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"전쟁의 전조\",\n" +
                "            \"id\": 120,\n" +
                "            \"key\": \"Hecarim\",\n" +
                "            \"name\": \"헤카림\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 약탈자\",\n" +
                "            \"id\": 121,\n" +
                "            \"key\": \"Khazix\",\n" +
                "            \"name\": \"카직스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"광전사\",\n" +
                "            \"id\": 2,\n" +
                "            \"key\": \"Olaf\",\n" +
                "            \"name\": \"올라프\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"마법공학 폭파병\",\n" +
                "            \"id\": 115,\n" +
                "            \"key\": \"Ziggs\",\n" +
                "            \"name\": \"직스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"어둠의 여제\",\n" +
                "            \"id\": 134,\n" +
                "            \"key\": \"Syndra\",\n" +
                "            \"name\": \"신드라\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"자운의 광인\",\n" +
                "            \"id\": 36,\n" +
                "            \"key\": \"DrMundo\",\n" +
                "            \"name\": \"문도 박사\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"깨우친 자\",\n" +
                "            \"id\": 43,\n" +
                "            \"key\": \"Karma\",\n" +
                "            \"name\": \"카르마\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"어둠의 아이\",\n" +
                "            \"id\": 1,\n" +
                "            \"key\": \"Annie\",\n" +
                "            \"name\": \"애니\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"그림자의 권\",\n" +
                "            \"id\": 84,\n" +
                "            \"key\": \"Akali\",\n" +
                "            \"name\": \"아칼리\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"울부짖는 천둥\",\n" +
                "            \"id\": 106,\n" +
                "            \"key\": \"Volibear\",\n" +
                "            \"name\": \"볼리베어\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"용서받지 못한 자\",\n" +
                "            \"id\": 157,\n" +
                "            \"key\": \"Yasuo\",\n" +
                "            \"name\": \"야스오\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"폭풍의 심장\",\n" +
                "            \"id\": 85,\n" +
                "            \"key\": \"Kennen\",\n" +
                "            \"name\": \"케넨\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"추적하는 사자\",\n" +
                "            \"id\": 107,\n" +
                "            \"key\": \"Rengar\",\n" +
                "            \"name\": \"렝가\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"룬 마법사\",\n" +
                "            \"id\": 13,\n" +
                "            \"key\": \"Ryze\",\n" +
                "            \"name\": \"라이즈\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"황혼의 눈\",\n" +
                "            \"id\": 98,\n" +
                "            \"key\": \"Shen\",\n" +
                "            \"name\": \"쉔\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"비밀 병기\",\n" +
                "            \"id\": 154,\n" +
                "            \"key\": \"Zac\",\n" +
                "            \"name\": \"자크\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"검의 그림자\",\n" +
                "            \"id\": 91,\n" +
                "            \"key\": \"Talon\",\n" +
                "            \"name\": \"탈론\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"녹서스 대장군\",\n" +
                "            \"id\": 50,\n" +
                "            \"key\": \"Swain\",\n" +
                "            \"name\": \"스웨인\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"영겁의 수호자\",\n" +
                "            \"id\": 432,\n" +
                "            \"key\": \"Bard\",\n" +
                "            \"name\": \"바드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"언데드 학살병기\",\n" +
                "            \"id\": 14,\n" +
                "            \"key\": \"Sion\",\n" +
                "            \"name\": \"사이온\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"어둠 사냥꾼\",\n" +
                "            \"id\": 67,\n" +
                "            \"key\": \"Vayne\",\n" +
                "            \"name\": \"베인\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"사막의 관리자\",\n" +
                "            \"id\": 75,\n" +
                "            \"key\": \"Nasus\",\n" +
                "            \"name\": \"나서스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"그림자 사신\",\n" +
                "            \"id\": 141,\n" +
                "            \"key\": \"Kayn\",\n" +
                "            \"name\": \"케인\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"카드의 달인\",\n" +
                "            \"id\": 4,\n" +
                "            \"key\": \"TwistedFate\",\n" +
                "            \"name\": \"트위스티드 페이트\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 공포\",\n" +
                "            \"id\": 31,\n" +
                "            \"key\": \"Chogath\",\n" +
                "            \"name\": \"초가스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"정령 주술사\",\n" +
                "            \"id\": 77,\n" +
                "            \"key\": \"Udyr\",\n" +
                "            \"name\": \"우디르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"정화의 사도\",\n" +
                "            \"id\": 236,\n" +
                "            \"key\": \"Lucian\",\n" +
                "            \"name\": \"루시안\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"자연의 아버지\",\n" +
                "            \"id\": 427,\n" +
                "            \"key\": \"Ivern\",\n" +
                "            \"name\": \"아이번\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"여명의 빛\",\n" +
                "            \"id\": 89,\n" +
                "            \"key\": \"Leona\",\n" +
                "            \"name\": \"레오나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"필트오버의 보안관\",\n" +
                "            \"id\": 51,\n" +
                "            \"key\": \"Caitlyn\",\n" +
                "            \"name\": \"케이틀린\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"혹한의 분노\",\n" +
                "            \"id\": 113,\n" +
                "            \"key\": \"Sejuani\",\n" +
                "            \"name\": \"세주아니\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"영원한 악몽\",\n" +
                "            \"id\": 56,\n" +
                "            \"key\": \"Nocturne\",\n" +
                "            \"name\": \"녹턴\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"시간의 수호자\",\n" +
                "            \"id\": 26,\n" +
                "            \"key\": \"Zilean\",\n" +
                "            \"name\": \"질리언\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"사막의 황제\",\n" +
                "            \"id\": 268,\n" +
                "            \"key\": \"Azir\",\n" +
                "            \"name\": \"아지르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"기계 악동\",\n" +
                "            \"id\": 68,\n" +
                "            \"key\": \"Rumble\",\n" +
                "            \"name\": \"럼블\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"타락한 천사\",\n" +
                "            \"id\": 25,\n" +
                "            \"key\": \"Morgana\",\n" +
                "            \"name\": \"모르가나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"바위술사\",\n" +
                "            \"id\": 163,\n" +
                "            \"key\": \"Taliyah\",\n" +
                "            \"name\": \"탈리야\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"날쌘 정찰병\",\n" +
                "            \"id\": 17,\n" +
                "            \"key\": \"Teemo\",\n" +
                "            \"name\": \"티모\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"살상 병기\",\n" +
                "            \"id\": 6,\n" +
                "            \"key\": \"Urgot\",\n" +
                "            \"name\": \"우르곳\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"슬픈 미라\",\n" +
                "            \"id\": 32,\n" +
                "            \"key\": \"Amumu\",\n" +
                "            \"name\": \"아무무\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"위대한 석상\",\n" +
                "            \"id\": 3,\n" +
                "            \"key\": \"Galio\",\n" +
                "            \"name\": \"갈리오\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"위대한 발명가\",\n" +
                "            \"id\": 74,\n" +
                "            \"key\": \"Heimerdinger\",\n" +
                "            \"name\": \"하이머딩거\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"얼음불사조\",\n" +
                "            \"id\": 34,\n" +
                "            \"key\": \"Anivia\",\n" +
                "            \"name\": \"애니비아\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"서리 궁수\",\n" +
                "            \"id\": 22,\n" +
                "            \"key\": \"Ashe\",\n" +
                "            \"name\": \"애쉬\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 눈\",\n" +
                "            \"id\": 161,\n" +
                "            \"key\": \"Velkoz\",\n" +
                "            \"name\": \"벨코즈\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"미친 화학자\",\n" +
                "            \"id\": 27,\n" +
                "            \"key\": \"Singed\",\n" +
                "            \"name\": \"신지드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"수정 선봉장\",\n" +
                "            \"id\": 72,\n" +
                "            \"key\": \"Skarner\",\n" +
                "            \"name\": \"스카너\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"응징의 화살\",\n" +
                "            \"id\": 110,\n" +
                "            \"key\": \"Varus\",\n" +
                "            \"name\": \"바루스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"역병 쥐\",\n" +
                "            \"id\": 29,\n" +
                "            \"key\": \"Twitch\",\n" +
                "            \"name\": \"트위치\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"데마시아의 힘\",\n" +
                "            \"id\": 86,\n" +
                "            \"key\": \"Garen\",\n" +
                "            \"name\": \"가렌\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"거대 증기 골렘\",\n" +
                "            \"id\": 53,\n" +
                "            \"key\": \"Blitzcrank\",\n" +
                "            \"name\": \"블리츠크랭크\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"우주 검사\",\n" +
                "            \"id\": 11,\n" +
                "            \"key\": \"MasterYi\",\n" +
                "            \"name\": \"마스터 이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"핏빛 항구의 학살자\",\n" +
                "            \"id\": 555,\n" +
                "            \"key\": \"Pyke\",\n" +
                "            \"name\": \"파이크\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"거미 여왕\",\n" +
                "            \"id\": 60,\n" +
                "            \"key\": \"Elise\",\n" +
                "            \"name\": \"엘리스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"미노타우로스\",\n" +
                "            \"id\": 12,\n" +
                "            \"key\": \"Alistar\",\n" +
                "            \"name\": \"알리스타\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"사악한 칼날\",\n" +
                "            \"id\": 55,\n" +
                "            \"key\": \"Katarina\",\n" +
                "            \"name\": \"카타리나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"시간을 달리는 소년\",\n" +
                "            \"id\": 245,\n" +
                "            \"key\": \"Ekko\",\n" +
                "            \"name\": \"에코\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"강철의 망령\",\n" +
                "            \"id\": 82,\n" +
                "            \"key\": \"Mordekaiser\",\n" +
                "            \"name\": \"모데카이저\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"요정 마법사\",\n" +
                "            \"id\": 117,\n" +
                "            \"key\": \"Lulu\",\n" +
                "            \"name\": \"룰루\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"강철의 그림자\",\n" +
                "            \"id\": 164,\n" +
                "            \"key\": \"Camille\",\n" +
                "            \"name\": \"카밀\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"다르킨의 검\",\n" +
                "            \"id\": 266,\n" +
                "            \"key\": \"Aatrox\",\n" +
                "            \"name\": \"아트록스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"화려한 처형자\",\n" +
                "            \"id\": 119,\n" +
                "            \"key\": \"Draven\",\n" +
                "            \"name\": \"드레이븐\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"강의 폭군\",\n" +
                "            \"id\": 223,\n" +
                "            \"key\": \"TahmKench\",\n" +
                "            \"name\": \"탐 켄치\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"전쟁의 장인\",\n" +
                "            \"id\": 80,\n" +
                "            \"key\": \"Pantheon\",\n" +
                "            \"name\": \"판테온\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"데마시아의 호위무사\",\n" +
                "            \"id\": 5,\n" +
                "            \"key\": \"XinZhao\",\n" +
                "            \"name\": \"신 짜오\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"별의 창조자\",\n" +
                "            \"id\": 136,\n" +
                "            \"key\": \"AurelionSol\",\n" +
                "            \"name\": \"아우렐리온 솔\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"눈먼 수도승\",\n" +
                "            \"id\": 64,\n" +
                "            \"key\": \"LeeSin\",\n" +
                "            \"name\": \"리 신\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"발로란의 방패\",\n" +
                "            \"id\": 44,\n" +
                "            \"key\": \"Taric\",\n" +
                "            \"name\": \"타릭\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 예언자\",\n" +
                "            \"id\": 90,\n" +
                "            \"key\": \"Malzahar\",\n" +
                "            \"name\": \"말자하\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 딸\",\n" +
                "            \"id\": 145,\n" +
                "            \"key\": \"Kaisa\",\n" +
                "            \"name\": \"카이사\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"차가운 달의 분노\",\n" +
                "            \"id\": 131,\n" +
                "            \"key\": \"Diana\",\n" +
                "            \"name\": \"다이애나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"요들 사수\",\n" +
                "            \"id\": 18,\n" +
                "            \"key\": \"Tristana\",\n" +
                "            \"name\": \"트리스타나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"공허의 복병\",\n" +
                "            \"id\": 421,\n" +
                "            \"key\": \"RekSai\",\n" +
                "            \"name\": \"렉사이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"진홍빛 사신\",\n" +
                "            \"id\": 8,\n" +
                "            \"key\": \"Vladimir\",\n" +
                "            \"name\": \"블라디미르\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"데마시아의 귀감\",\n" +
                "            \"id\": 59,\n" +
                "            \"key\": \"JarvanIV\",\n" +
                "            \"name\": \"자르반 4세\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"파도 소환사\",\n" +
                "            \"id\": 267,\n" +
                "            \"key\": \"Nami\",\n" +
                "            \"name\": \"나미\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"잔혹극의 거장\",\n" +
                "            \"id\": 202,\n" +
                "            \"key\": \"Jhin\",\n" +
                "            \"name\": \"진\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"별의 아이\",\n" +
                "            \"id\": 16,\n" +
                "            \"key\": \"Soraka\",\n" +
                "            \"name\": \"소라카\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"악의 작은 지배자\",\n" +
                "            \"id\": 45,\n" +
                "            \"key\": \"Veigar\",\n" +
                "            \"name\": \"베이가\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"폭풍의 분노\",\n" +
                "            \"id\": 40,\n" +
                "            \"key\": \"Janna\",\n" +
                "            \"name\": \"잔나\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"심해의 타이탄\",\n" +
                "            \"id\": 111,\n" +
                "            \"key\": \"Nautilus\",\n" +
                "            \"name\": \"노틸러스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"고통스런 포옹\",\n" +
                "            \"id\": 28,\n" +
                "            \"key\": \"Evelynn\",\n" +
                "            \"name\": \"이블린\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"술취한 난동꾼\",\n" +
                "            \"id\": 79,\n" +
                "            \"key\": \"Gragas\",\n" +
                "            \"name\": \"그라가스\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"그림자의 주인\",\n" +
                "            \"id\": 238,\n" +
                "            \"key\": \"Zed\",\n" +
                "            \"name\": \"제드\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"필트오버의 집행자\",\n" +
                "            \"id\": 254,\n" +
                "            \"key\": \"Vi\",\n" +
                "            \"name\": \"바이\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"심연의 아귀\",\n" +
                "            \"id\": 96,\n" +
                "            \"key\": \"KogMaw\",\n" +
                "            \"name\": \"코그모\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"구미호\",\n" +
                "            \"id\": 103,\n" +
                "            \"key\": \"Ahri\",\n" +
                "            \"name\": \"아리\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"데마시아의 날개\",\n" +
                "            \"id\": 133,\n" +
                "            \"key\": \"Quinn\",\n" +
                "            \"name\": \"퀸\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"환술사\",\n" +
                "            \"id\": 7,\n" +
                "            \"key\": \"Leblanc\",\n" +
                "            \"name\": \"르블랑\"\n" +
                "        },\n" +
                "         {\n" +
                "            \"title\": \"방탕한 탐험가\",\n" +
                "            \"id\": 81,\n" +
                "            \"key\": \"Ezreal\",\n" +
                "            \"name\": \"이즈리얼\"\n" +
                "        }]\n" +
                "    }";
        log.info("start champmap");
        ObjectMapper mapper = new ObjectMapper();
        try {
            Champion list = mapper.readValue(json, Champion.class);
            for(Champion champion:list.getData()) {
//                    tempStatMapper.insertCham(champion);
                champMap.put(champion.getId(),champion.getName());
            }
        } catch(Exception e) {
            log.info("error",e);
        }
        for( Map.Entry<Integer, String> elem : champMap.entrySet() ){
            System.out.println( String.format("키 : %s, 값 : %s", elem.getKey(), elem.getValue()) );
        }


        return champMap;

    }

}
